app/controllers/events_controller.rb

	def index
		#@events = Event.all
		@events = Event.page(params[:page]).per(5)
---
SELECT  "events".* FROM "events" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events"

	def edit
		if params[:id] == nil
			@event = Event.new
		else
			@event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		if params[:id] == nil
			@event = Event.new(event_params)
			if @event.save
				flash[:notice] = "event was successfully created	"
				redirect_to :action => :index
			end
		else
			@event = Event.find(params[:id])
			if @event.update(event_params)
---
INSERT INTO "events" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "PHP"], ["description", "PHP 999"], ["created_at", 2016-10-30 08:37:23 UTC], ["updated_at", 2016-10-30 08:37:23 UTC]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "456555"], ["updated_at", 2016-10-30 08:22:38 UTC], ["id", 2]]